app/views/claims/requests.html.erb

        <div class="alert alert-info no-requests" role="alert">
          <p class="lead">No requests matched your filters :(<br/> Please check back later!</p>
        </div>
      <% end %>
      <% @requests.each do |request| %>
        <div class="requests-card" id="request_<%=request.id%>">
          <h4 class="card-title">
            <%= request.title %>
          </h4>
          <p class="card-text">
            <%= request.description %><br />
            From <%= request.from_language %> to  <%= request.to_language %><br />
          </p>
          <p class="card-text deadline">Deadline: <%= request.deadline.to_s[0..10] %> </p>

          <div class="card-row">
            <div class="card-col-1">
              <div class="tags-container">
                <span class="tag tag-pink"><%= request.num_claims%> Claims</span>
                <% if request.categories%>
                  <% request.categories.each do |c| %>
                    <span class="tag tag-blue"><%= "#{c}" %></span>
---
SELECT "requests".* FROM "requests" WHERE "requests"."from_language" = ? AND "requests"."to_language" = ?  [["from_language", "Chinese"], ["to_language", "French"]]