app/controllers/claims_controller.rb

  def requests
    @claim = Claim.new
    claimed_ids = Claim.where(translator_tarjimly_id: @translatorID).pluck(:request_id)
    @no_pending_reqs =  Request.where.not(id: claimed_ids).empty?
    if params.has_key?(:from_language)
      @requests = Request.where(:from_language => params[:from_language].capitalize, :to_language => params[:to_language].capitalize).where.not(id: claimed_ids, _status: 2)
---
SELECT "requests".* FROM "requests"
SELECT "requests".* FROM "requests" WHERE "requests"."from_language" = ? AND "requests"."to_language" = ?  [["from_language", "Chinese"], ["to_language", "French"]]