app/controllers/requests_controller.rb

    def index
        @name = session[:name]
        @role = session[:role]
        @status = params[:status] || [0, 1]
        @requests = Request.where(user_tarjimly_id: @userID, _status: @status)
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_tarjimly_id" = ?  [["user_tarjimly_id", 1]]

    def show
        rid = params[:request_id]
        @request = Request.find_by_id(rid)
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @request = Request.new(request_params)
        #TODO: should be a validation and include rest
        if @request.nil? || @request.deadline.nil?
            redirect_to new_request_url
            return
        end
        upload_format = params[:request][:format] || "text"
        if upload_format != "text"
            filename_string = @request.document_uploads.first.filename.to_s
            upload_format =  File.extname(filename_string)
            upload_format = upload_format[1..-1]
        end
        @request.document_format = upload_format
        @request.user_tarjimly_id = @userID
        @request.num_claims = 0 #TODO: Should be daault in db
        @request._status = 0  #TODO: Should be daault in db
        @request.deadline = @request.deadline.time.in_time_zone("UTC")
        if @request.save
---
INSERT INTO "requests" ("user_tarjimly_id", "from_language", "to_language", "document", "document_format", "deadline", "title", "description", "categories", "num_claims", "_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)